tap "apple/apple", "http://github.com/apple/homebrew-apple"
tap "felixkratz/formulae"
tap "marcus-crane/tap"
tap "mhaeuser/mhaeuser"
# Next-gen compiler infrastructure
brew "llvm"
# Columnar in-memory analytics layer designed to accelerate big data
brew "apache-arrow"
# GLib bindings for Apache Arrow
brew "apache-arrow-glib"
# Official Amazon AWS command-line interface
brew "awscli"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Bash scripts that integrate bat with various command-line tools
brew "bat-extras"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Secure and free password manager for all of your devices
brew "bitwarden-cli"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Cross-platform make
brew "cmake"
# Create and run Linux containers using lightweight virtual machines
brew "container", link: false
# High performance csv viewer for cli
brew "csview"
# Command-line tool to interact with exercism.io
brew "exercism"
# Modern, maintained replacement for ls
brew "eza"
# Functional programming language for real time signal processing
brew "faust"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# GNU compiler collection
brew "gcc"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Render markdown on the CLI
brew "glow"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Improved top (interactive process viewer)
brew "htop"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2@1.7"
# YAML Parser
brew "libyaml"
# Next-gen compiler infrastructure
brew "llvm@15"
# Language Server for the Lua language
brew "lua-language-server"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Netwide Assembler (NASM) is an 80x86 assembler
brew "nasm"
# NCurses Disk Usage
brew "ncdu"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Create, run, and share large language models (LLMs)
brew "ollama", restart_service: :changed
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# AI coding agent, built for the terminal
brew "opencode"
# Fast, disk space efficient package manager
brew "pnpm"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Safe, concurrent, practical language
brew "rust"
# Cross-shell prompt for astronauts
brew "starship"
# Scriptable music downloader for Qobuz, Tidal, SoundCloud, and Deezer
brew "streamrip"
# LSP for TailwindCSS
brew "tailwindcss-language-server"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Powerful free data recovery utility
brew "testdisk"
# Simplified and community-driven man pages
brew "tldr"
# Language Server Protocol implementation for TypeScript wrapping tsserver
brew "typescript-language-server"
# Command-line interface for Vercel
brew "vercel-cli"
# Simple terminal image viewer written in Rust
brew "viu"
# Language servers for HTML, CSS, JavaScript, and JSON extracted from vscode
brew "vscode-langservers-extracted"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Easily fetch videogame soundtracks from downloads.khinsider.com
brew "marcus-crane/tap/khinsider"
# Memory training application
cask "anki"
# Multi-track audio editor and recorder
cask "audacity"
# Control the platform power state of your Apple Silicon device
cask "battery-toolkit"
# Online gaming platform
cask "battle-net"
# Open source IDE for exploring and testing APIs
cask "bruno"
# E-books management software
cask "calibre"
# Create and run Linux containers using lightweight virtual machines
cask "container"
# Preference Pane for controlling cursor hiding
cask "cursorcerer"
# API documentation browser and code snippet manager
cask "dash"
# Voice and text chat software
cask "discord"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-monaspace"
# GIT client
cask "fork"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Graphically shows disk usage within a file system
cask "grandperspective"
# Free and open-source media player
cask "iina"
# HTTP and GraphQL Client
cask "insomnia"
# File archiver
cask "keka"
# Open-source keystroke visualiser
cask "keycastr"
# Free and open-source painting and sketching program
cask "krita"
# Multiplayer online battle arena game
cask "league-of-legends"
# Markdown editor
cask "mark-text"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Sandbox construction video game
cask "minecraft"
# App to write, plan, collaborate, and get organised
cask "notion"
# Replacement for Docker Desktop
cask "orbstack"
# Simple Gtk# Paint Program
cask "pinta"
# Peer to peer Bitorrent client
cask "qbittorrent"
# Control your tools with a few keystrokes
cask "raycast"
# Tool that provides consistent, highly configurable symbols for apps
cask "sf-symbols"
# Team communication and collaboration software
cask "slack"
# Video game digital distribution service
cask "steam"
# Quicklook extension for source files
cask "syntax-highlight"
# Google Chromium, sans integration with Google
cask "ungoogled-chromium"
# Open-source code editor
cask "visual-studio-code"
# Native desktop client for WhatsApp
cask "whatsapp"
vscode "castwide.solargraph"
vscode "catppuccin.catppuccin-vsc"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "elia.erb-formatter"
vscode "esbenp.prettier-vscode"
vscode "misogi.ruby-rubocop"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.live-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "rubocop.vscode-rubocop"
vscode "shopify.ruby-lsp"
