tap "apple/apple", "http://github.com/apple/homebrew-apple"
tap "felixkratz/formulae"
tap "fsouza/prettierd"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "marcus-crane/tap"
tap "mutagen-io/mutagen"
tap "playcover/playcover"
brew "awscli"
brew "libgit2"
brew "bat"
brew "node"
brew "bitwarden-cli"
brew "gcc"
brew "cava"
brew "chezmoi"
brew "cmake"
brew "csview"
brew "deno"
brew "exercism"
brew "eza"
brew "faust"
brew "fd"
brew "ffmpeg"
brew "fish"
brew "gh"
brew "git"
brew "git-delta"
brew "glow"
brew "htop"
brew "imagemagick"
brew "openjdk"
brew "jdtls"
brew "jq"
brew "libgit2@1.7"
brew "libyaml"
brew "llvm"
brew "llvm@15"
brew "lolcat"
brew "mise"
brew "nasm"
brew "ncdu"
brew "neofetch"
brew "neovim"
brew "ollama"
brew "pnpm"
brew "postgresql@14"
brew "ripgrep"
brew "rust"
brew "starship"
brew "terminal-notifier"
brew "testdisk"
brew "tldr"
brew "tmux"
brew "vercel-cli"
brew "viu"
brew "watchman"
brew "wget"
brew "xcbeautify"
brew "xcode-build-server"
brew "yt-dlp"
brew "felixkratz/formulae/sketchybar"
brew "fsouza/prettierd/prettierd"
brew "marcus-crane/tap/khinsider"
brew "mutagen-io/mutagen/mutagen-compose"
cask "activitywatch"
cask "anki"
cask "audacity"
cask "battle-net"
cask "bruno"
cask "calibre"
cask "cursorcerer"
cask "dash"
cask "discord"
cask "docker"
cask "eloston-chromium"
cask "figma"
cask "firefox"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-monaspace"
cask "fork"
cask "ghostty"
cask "grandperspective"
cask "hyper"
cask "iina"
cask "inkscape"
cask "insomnia"
cask "keka"
cask "keycastr"
cask "kitty"
cask "krita"
cask "league-of-legends"
cask "mark-text"
cask "microsoft-auto-update"
cask "minecraft"
cask "mp3tag"
cask "ngrok"
cask "notion"
cask "openemu"
cask "openmtp"
cask "openvpn-connect"
cask "pinta"
cask "playcover-community"
cask "qbittorrent"
cask "rawtherapee"
cask "raycast"
cask "sf-symbols"
cask "slack"
cask "sonos"
cask "steam"
cask "syntax-highlight"
cask "toinane-colorpicker"
cask "tor-browser"
cask "visual-studio-code"
cask "whatsapp"
cask "wowup"
cask "zoom"
vscode "castwide.solargraph"
vscode "catppuccin.catppuccin-vsc"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "elia.erb-formatter"
vscode "esbenp.prettier-vscode"
vscode "misogi.ruby-rubocop"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.live-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "rubocop.vscode-rubocop"
vscode "shopify.ruby-lsp"
